import math

# зчитування координат точок А та В
x1 = float(input("Введіть координату x1: "))
y1 = float(input("Введіть координату y1: "))
x2 = float(input("Введіть координату x2: "))
y2 = float(input("Введіть координату y2: "))

# обчислення кутів між відрізками та віссю ОХ
angle_a = math.atan2(y1, x1)
angle_b = math.atan2(y2, x2)

# порівняння кутів та виведення результату
if angle_a > angle_b:
    print("Відрізок ОА утворює більший кут з віссю ОХ.")
else:
    print("Відрізок ОВ утворює більший кут з віссю ОХ.")
